#+BLOG: wordpress
#+POSTID: 335
#+DATE: [2016-06-27 Mon 10:32]
#+OPTIONS: toc:nil num:nil todo:nil pri:nil tags:nil ^:nil tex:t  
#+CATEGORY: Cpp, Julia, Computations
#+TAGS:
#+DESCRIPTION:
#+TITLE: Some remarks about min()/max() functions

Computing the *min* (or *max*) of two values looks like a trivial
task.

For *C++* the default Standard Template Library implementation is

#+BEGIN_SRC C++ :exports code
inline const _Tp& min(const _Tp& __a, const _Tp& __b)
{
	return __b < __a ? __b : __a;
}
#+END_SRC

However for numerical computations this definition does not mix well
with the [[https://en.wikipedia.org/wiki/IEEE_floating_point][IEEE 754]] standard when dealing with potential *NaN* value.

For instance, *min()* is *not commutative* and is *not equivatent to
cmath::fmin()*.

We have:

#+BEGIN_SRC C++ :main no :flags -std=c++11 :results org :exports both
#include <iostream>
#include <cmath>
#include <limits>
#include <cassert>

using namespace std;

int main()
{
    const auto x_nan = numeric_limits<double>::quiet_NaN();
    const auto x_1 = 1.;

    cout << boolalpha;

    cout << "\n\ncommutativity?";

    cout << "\n min: "
	 << (min(x_1, x_nan) == min(x_nan, x_1));

    cout << "\nfmin: "
	 << (fmin(x_1, x_nan) == fmin(x_nan, x_1));
}
#+END_SRC

#+RESULTS:
#+BEGIN_SRC org
commutativity?
 min: false
fmin: true
#+END_SRC

The [[https://en.wikipedia.org/wiki/NaN][IEEE 754]] says:
#+BEGIN_QUOTE
In section 6.2 of the revised IEEE 754-2008 standard there are two
anomalous functions (the maxnum and minnum functions that return the
maximum of two operands that are expected to be numbers) that favor
numbers — *if just one of the operands is a NaN then the value of the
other operand is returned.*
#+END_QUOTE

On the opposite you can read about C++ rules [[http://www.drdobbs.com/cpp/its-hard-to-compare-floating-point-numbe/240149806][here]]:
#+BEGIN_QUOTE
NaN values have the curious property that they compare as "unordered"
* A source of bugs?

You have to take care that a simple statement like $$ x\le\min(x,y) $$
is mathematically true but false in your code. It is even false for
both the IEEE 754 and the comparison based versions of the *min()* function.

In the future I will write a post on [[https://en.wikipedia.org/wiki/Automatic_differentiation][Automatic Differentiation]]. To be
brief *automatic differentiation* is a tool that allows you to
*efficiently* compute gradient with nearly no modification of your
original code. As example my personal implementation takes the form:

#+BEGIN_SRC C++
// Declare the current tape
//
AD_Tape<double> tape;

// Computes gradient of f(x,y,z)=x.z.sin(x.y)
//                   at (x,y,z)=(2,1,5)
//
// Note:
//
// grad(f)={ x * y * z * Cos(x * y) + z * Sin(x * y),
//           x^2 * z *
//           Cos(x * y), x * Sin(x * y) }
//
AD_Scalar<double> x, y, z, f;

x = 2;
y = 1;
z = 5;

f = x * z * sin(x * y);

const auto grad = ad_gradient(f);

std::cout << "\ngrad(f) = {"
          << grad[x] << "," 
          << grad[y] << ","
          << grad[z] << "}";

// The screen output is
//
// grad(f) = {0.385019,-8.32294,1.81859}
#+END_SRC

One classical approach uses *operator overloading*. For each basic
operation you compute the *function value* and its *differential*.

One *important and desirable property of AutoDiff library* is that its
use *does not modify your program result.*

Unfortunately a lot of AutoDiff libraries are bugged when they define
the min()/max() functions.

It is really "natural" to define *min()* overloading by something like:

#+BEGIN_SRC julia
function min(x,y)
    ifelse(x<y,
           return (x,dx),
           return (y,dy))
#+END_SRC

But *this implementation is buggy:* if *y* is *NaN* we now know that *x<y* is always false, hence:
- the original code will return *x*
- the AutoDiff code will return *(y,dy)* (a priori *=(NaN,NaN)*)

To stay *consistent* the *correct* implementation is something like:

#+BEGIN_SRC julia
function min(x,y)
    ifelse(x==min(x,y),
           return (x,dx),
           return (y,dy))
#+END_SRC

which provides the right result (id consistent with the original code)
whatever *x* or *y* is *NaN* or not

We can check that, for instance, with [[https://github.com/JuliaDiff/ForwardDiff.jl][Julia ForwardDiff.jl]] 

(githash: 045a828)

#+BEGIN_SRC julia :results output :exports both
using ForwardDiff
f(x::Vector)=max(2*x[1],x[2]);
x=[1.,NaN]
print("Original value: $(f(x))")
print("\nAutoDiff gradient: $(ForwardDiff.gradient(f, x))")
#+END_SRC

#+RESULTS:
: Original code: 1.0
: AutoDiff code: [0.0,1.0]

which is *wrong*, in this case the *right* gradient is
$$
\nabla [(x_1,x_2)\rightarrow max(2.x_1,x_2)]_{x_1=1,x_2=NaN}=(2,0)
$$

